In [1]:
l = [1,2,3,4,5]

def get_square(l):
    for i in l:
        yield i**2
        
result = get_square(l)

result

In [3]:
next(result)

4

In [12]:
a = "Nihar"
r = "-".join(i.upper() for i in list(a))
r

'N-I-H-A-R'

In [5]:
a.split()

['NIhar']

In [11]:
a.rstrip()

' Nihar'

In [9]:
a

' Nihar'

In [1]:
 
# Import the numpy library
import numpy as np
 
# Define the dataset
x = np.array([1,3,5,7,8,9, 10, 15])
y = np.array([10, 20, 30, 40, 50, 60, 70, 80])

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'X':x, 'Y': y})
df

    X   Y
0   1  10
1   3  20
2   5  30
3   7  40
4   8  50
5   9  60
6  10  70
7  15  80

In [5]:
df.corr()

          X         Y
X  1.000000  0.974894
Y  0.974894  1.000000

In [6]:
df.cov()

            X           Y
X   19.071429  104.285714
Y  104.285714  600.000000

# Proven theory

In [9]:
df = pd.DataFrame({'x':x, 'x1': 2*x, 'x2': 3*x, 'x3': 4*x,'x4': 5*x})
df

    x  x1  x2  x3  x4
0   1   2   3   4   5
1   3   6   9  12  15
2   5  10  15  20  25
3   7  14  21  28  35
4   8  16  24  32  40
5   9  18  27  36  45
6  10  20  30  40  50
7  15  30  45  60  75

In [10]:
df.corr()

      x   x1   x2   x3   x4
x   1.0  1.0  1.0  1.0  1.0
x1  1.0  1.0  1.0  1.0  1.0
x2  1.0  1.0  1.0  1.0  1.0
x3  1.0  1.0  1.0  1.0  1.0
x4  1.0  1.0  1.0  1.0  1.0

In [11]:
df.cov()

            x          x1          x2          x3          x4
x   19.071429   38.142857   57.214286   76.285714   95.357143
x1  38.142857   76.285714  114.428571  152.571429  190.714286
x2  57.214286  114.428571  171.642857  228.857143  286.071429
x3  76.285714  152.571429  228.857143  305.142857  381.428571
x4  95.357143  190.714286  286.071429  381.428571  476.785714

In [12]:
df = pd.DataFrame({'x':x, 'x1': -2*x, 'x2': -3*x, 'x3': -4*x,'x4': -5*x})
df

    x  x1  x2  x3  x4
0   1  -2  -3  -4  -5
1   3  -6  -9 -12 -15
2   5 -10 -15 -20 -25
3   7 -14 -21 -28 -35
4   8 -16 -24 -32 -40
5   9 -18 -27 -36 -45
6  10 -20 -30 -40 -50
7  15 -30 -45 -60 -75

In [13]:
df.corr()

      x   x1   x2   x3   x4
x   1.0 -1.0 -1.0 -1.0 -1.0
x1 -1.0  1.0  1.0  1.0  1.0
x2 -1.0  1.0  1.0  1.0  1.0
x3 -1.0  1.0  1.0  1.0  1.0
x4 -1.0  1.0  1.0  1.0  1.0

In [14]:
df.cov()

            x          x1          x2          x3          x4
x   19.071429  -38.142857  -57.214286  -76.285714  -95.357143
x1 -38.142857   76.285714  114.428571  152.571429  190.714286
x2 -57.214286  114.428571  171.642857  228.857143  286.071429
x3 -76.285714  152.571429  228.857143  305.142857  381.428571
x4 -95.357143  190.714286  286.071429  381.428571  476.785714

In [9]:
import numpy as np

a = np.array([np.random.uniform(-5.12, 5.12) for j in range(9)])

In [11]:
a.reshape(3,3)

array([[ 4.88560207,  3.139414  ,  4.82135655],
       [ 4.37597775,  0.67867791,  3.60153769],
       [ 2.16335404, -2.66794624, -3.30805722]])